#!/bin/bash
set -e

echo -e ""
echo "  ██╗     ██╗██╗   ██╗██████╗ ███████╗    ██████╗  ██████╗ ██████╗ "
echo "  ██║     ██║██║   ██║██╔══██╗██╔════╝    ██╔══██╗██╔═══██╗██╔══██╗"
echo "  ██║     ██║██║   ██║██████╔╝█████╗      ██║  ██║██║   ██║██████╔╝"
echo "  ██║     ██║╚██╗ ██╔╝██╔══██╗██╔══╝      ██║  ██║██║   ██║██╔══██╗"
echo "  ███████╗██║ ╚████╔╝ ██║  ██║███████╗    ██████╔╝╚██████╔╝██║  ██║"
echo "  ╚══════╝╚═╝  ╚═══╝  ╚═╝  ╚═╝╚══════╝    ╚═════╝  ╚═════╝ ╚═╝  ╚═╝"
echo -e ""

if ! command -v docker &> /dev/null; then
  echo "Erreur : Docker n'est pas installé."
  exit 1
fi

if [ ! -f "./secret/.env" ]; then
  echo "Erreur : ./secret/.env est introuvable."
  exit 1
fi

docker compose up -d --remove-orphans

echo "Application démarrée : http://localhost:8080"
